garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1776.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3RTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3RTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSS" edc:desc="" edc:mask="0xf" edc:name="RTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RTSS0" edc:desc="" edc:mask="0x1" edc:name="RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS1" edc:desc="" edc:mask="0x1" edc:name="RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS2" edc:desc="" edc:mask="0x1" edc:name="RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS3" edc:desc="" edc:mask="0x1" edc:name="RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3RTSS0" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS1" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS2" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS3" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3FTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3FTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FTSS" edc:desc="" edc:mask="0xf" edc:name="FTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="FTSS0" edc:desc="" edc:mask="0x1" edc:name="FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS1" edc:desc="" edc:mask="0x1" edc:name="FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS2" edc:desc="" edc:mask="0x1" edc:name="FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS3" edc:desc="" edc:mask="0x1" edc:name="FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3FTSS0" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS1" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS2" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS3" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3INS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3INS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INS" edc:desc="" edc:mask="0xf" edc:name="INS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="INS0" edc:desc="" edc:mask="0x1" edc:name="INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS1" edc:desc="" edc:mask="0x1" edc:name="INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS2" edc:desc="" edc:mask="0x1" edc:name="INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS3" edc:desc="" edc:mask="0x1" edc:name="INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3INS0" edc:desc="" edc:mask="0x1" edc:name="RG3INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS1" edc:desc="" edc:mask="0x1" edc:name="RG3INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS2" edc:desc="" edc:mask="0x1" edc:name="RG3INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS3" edc:desc="" edc:mask="0x1" edc:name="RG3INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PRG3CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PRG3CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OS" edc:desc="" edc:mask="0x1" edc:name="OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REDG" edc:desc="" edc:mask="0x1" edc:name="REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FEDG" edc:desc="" edc:mask="0x1" edc:name="FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3GO" edc:desc="" edc:mask="0x1" edc:name="RG3GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3OS" edc:desc="" edc:mask="0x1" edc:name="RG3OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE" edc:desc="" edc:mask="0x3" edc:name="RG3MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RG3REDG" edc:desc="" edc:mask="0x1" edc:name="RG3REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FEDG" edc:desc="" edc:mask="0x1" edc:name="RG3FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG3EN" edc:desc="" edc:mask="0x1" edc:name="RG3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE0" edc:desc="" edc:mask="0x1" edc:name="RG3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE1" edc:desc="" edc:mask="0x1" edc:name="RG3MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
