garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1776.PIC
        <edc:SFRDef edc:access="-----rnn" edc:cname="PRG3CON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PRG3CON1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPOL" edc:desc="" edc:mask="0x1" edc:name="RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FPOL" edc:desc="" edc:mask="0x1" edc:name="FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3RPOL" edc:desc="" edc:mask="0x1" edc:name="RG3RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FPOL" edc:desc="" edc:mask="0x1" edc:name="RG3FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RDY" edc:desc="" edc:mask="0x1" edc:name="RG3RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG3CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG3CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3ISET" edc:desc="" edc:mask="0x1f" edc:name="RG3ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG3ISET0" edc:desc="" edc:mask="0x1" edc:name="RG3ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET1" edc:desc="" edc:mask="0x1" edc:name="RG3ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET2" edc:desc="" edc:mask="0x1" edc:name="RG3ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET3" edc:desc="" edc:mask="0x1" edc:name="RG3ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET4" edc:desc="" edc:mask="0x1" edc:name="RG3ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x80C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3PHR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x3f" edc:name="PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHR0" edc:desc="" edc:mask="0x1" edc:name="PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR1" edc:desc="" edc:mask="0x1" edc:name="PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR2" edc:desc="" edc:mask="0x1" edc:name="PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR3" edc:desc="" edc:mask="0x1" edc:name="PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR4" edc:desc="" edc:mask="0x1" edc:name="PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR5" edc:desc="" edc:mask="0x1" edc:name="PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3PHR0" edc:desc="" edc:mask="0x1" edc:name="G3PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR1" edc:desc="" edc:mask="0x1" edc:name="G3PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR2" edc:desc="" edc:mask="0x1" edc:name="G3PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR3" edc:desc="" edc:mask="0x1" edc:name="G3PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR4" edc:desc="" edc:mask="0x1" edc:name="G3PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR5" edc:desc="" edc:mask="0x1" edc:name="G3PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3PHF0" edc:desc="" edc:mask="0x1" edc:name="G3PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF1" edc:desc="" edc:mask="0x1" edc:name="G3PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF2" edc:desc="" edc:mask="0x1" edc:name="G3PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF3" edc:desc="" edc:mask="0x1" edc:name="G3PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF4" edc:desc="" edc:mask="0x1" edc:name="G3PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF5" edc:desc="" edc:mask="0x1" edc:name="G3PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3BLKR0" edc:desc="" edc:mask="0x1" edc:name="G3BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR1" edc:desc="" edc:mask="0x1" edc:name="G3BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR2" edc:desc="" edc:mask="0x1" edc:name="G3BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR3" edc:desc="" edc:mask="0x1" edc:name="G3BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR4" edc:desc="" edc:mask="0x1" edc:name="G3BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR5" edc:desc="" edc:mask="0x1" edc:name="G3BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x810">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3BLKF0" edc:desc="" edc:mask="0x1" edc:name="G3BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF1" edc:desc="" edc:mask="0x1" edc:name="G3BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF2" edc:desc="" edc:mask="0x1" edc:name="G3BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF3" edc:desc="" edc:mask="0x1" edc:name="G3BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF4" edc:desc="" edc:mask="0x1" edc:name="G3BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF5" edc:desc="" edc:mask="0x1" edc:name="G3BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x811">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3DBR0" edc:desc="" edc:mask="0x1" edc:name="G3DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR1" edc:desc="" edc:mask="0x1" edc:name="G3DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR2" edc:desc="" edc:mask="0x1" edc:name="G3DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR3" edc:desc="" edc:mask="0x1" edc:name="G3DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR4" edc:desc="" edc:mask="0x1" edc:name="G3DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBR5" edc:desc="" edc:mask="0x1" edc:name="G3DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x812">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G3DBF0" edc:desc="" edc:mask="0x1" edc:name="G3DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF1" edc:desc="" edc:mask="0x1" edc:name="G3DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF2" edc:desc="" edc:mask="0x1" edc:name="G3DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF3" edc:desc="" edc:mask="0x1" edc:name="G3DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF4" edc:desc="" edc:mask="0x1" edc:name="G3DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3DBF5" edc:desc="" edc:mask="0x1" edc:name="G3DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3DBF" edc:desc="" edc:mask="0x3f" edc:name="G3DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
